#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.function_apps.azurerm_key_vault_secret.func_user_default_key must be replaced
-/+ resource "azurerm_key_vault_secret" "func_user_default_key" {
      ~ id                      = "https://io-p-itn-wallet-kv-01.vault.azure.net/secrets/funciowallet-KEY-APPBACKEND/ad6c8a19da3948fca7de5e5e3b200e96" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common" # forces replacement
        name                    = "funciowallet-KEY-APPBACKEND"
      ~ resource_id             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01/secrets/funciowallet-KEY-APPBACKEND/versions/ad6c8a19da3948fca7de5e5e3b200e96" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01/secrets/funciowallet-KEY-APPBACKEND" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "ad6c8a19da3948fca7de5e5e3b200e96" -> (known after apply)
      ~ versionless_id          = "https://io-p-itn-wallet-kv-01.vault.azure.net/secrets/funciowallet-KEY-APPBACKEND" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
